from typing import NoReturn


隠密の刃 = 1980
恐怖の面 = 2400
敏捷の石 = 1500
旅人のブーツ = 2820
隠者の香炉 = 1680
無常な処刑人 = 1200
神論のペンダント = 1140
見習いの印  = 2160
詩人の盃 = 1560
剣術の籠手 = 1620
慈愛の石 = 2400
勇気の石 = 2100
新兵のベルト = 2880
衛兵の服 = 2160
決意の石 = 2220
シンプルカイトシールド = 2760
知恵の石 = 1980
智者の本 = 1800

怒りの咆哮 = 無常な処刑人 + 隠密の刃 + 2040
国王殺しの匕首 = + 隠密の刃 + 無常な処刑人 + 神論のペンダント + 900
懺悔の面 = 恐怖の面 + 2040 + 見習いの印
敏捷の眼 = (敏捷の石 * 2) + 1860
ローウェスのブーツ = 旅人のブーツ + 神論のペンダント + 3240
神殿の香炉 = 隠者の香炉 + 見習いの印 + 2760
斥候の抱擁 = 衛兵の服 + 恐怖の面 + 1140
残陽の誓い = (神論のペンダント * 3) + 540
議会の印 = 見習いの印 + 神論のペンダント + 隠者の香炉 + 1020
くろがねの盾 = シンプルカイトシールド + 衛兵の服 + 見習いの印 + 120
士官のベルト = 新兵のベルト + 衛兵の服 + 恐怖の面 + 360
傭兵の甲手 = (剣術の籠手 * 2)  + 1680
ミスリルの聖杯 = (詩人の盃 * 2) + 智者の本 + 1680
魔紋の本 = (智者の本 * 2) + 詩人の盃 + 1440
勇気の眼 = (勇気の石 * 2) + 1500
決意の眼 = (決意の石 * 2) + 1380
知恵の眼 = (知恵の石 * 2)+ 1320
慈愛の眼 = (慈愛の石 * 2)+ 1020

貴族の刃 = 怒りの咆哮 + 国王殺しの匕首 + 5760
ブリッツアーク = 国王殺しの匕首 + 怒りの咆哮 + 3360
不滅の刻印 = 士官のベルト + 傭兵の甲手 + 議会の印 + 4080
浄罪の香炉 = 神殿の香炉 + 議会の印 + 10800
ボディオブグレイス = くろがねの盾 + 斥候の抱擁 + シンプルカイトシールド + 1740
防衛の壁 = (くろがねの盾 * 2) + 斥候の抱擁 + 1500
沈黙のヴェール = 懺悔の面 + 斥候の抱擁 + 残陽の誓い + 2340
敏捷のコア = (敏捷の眼 * 2) + 2280
ランブラーブーツ = ローウェスのブーツ + 議会の印 + 9600
不滅の冠 = (残陽の誓い * 3) + 1320
クイリンのリング = ミスリルの聖杯 + 魔紋の本 + 詩人の盃 + 4440
聖徒の刻印 = 議会の印 + 士官のベルト + 4200
真理の訓戒 = 知恵の眼 + 魔紋の本 + 6120
勇気のコア = (勇気の眼*2) + 2400
決意のコア = (決意の眼*2)+2160
剣闘士のブレスレット = 傭兵の甲手+神殿の香炉 +2880
知恵のコア = (知恵の眼*2)+5040
慈愛のコア = (慈愛の眼*2)+3960

並外れの闘士 = 貴族の刃 + ブリッツアーク + 不滅の冠 + 12600
蒼穹のハンター = ブリッツアーク + 貴族の刃 + 不滅の冠 + 3600
バジリカの聖炉 = (浄罪の香炉 * 2) + 聖徒の刻印 + 31200
光の使徒 = (ボディオブグレイス * 2) + 防衛の壁 + くろがねの盾 + 2400
静寂のヴェール = 沈黙のヴェール + ボディオブグレイス + 不滅の冠 + 16800
敏捷の心= (敏捷のコア * 3) + 36000
黎明の歩み = ランブラーブーツ + 聖徒の刻印 + 沈黙のヴェール + 30600
諸王の冠 =  (不滅の冠 * 2) + クイリンのリング + 10200
星の眷属 = 聖徒の刻印 + ランブラーブーツ + 不滅の刻印 + 17400
知恵の心 = (知恵のコア*3)+25200
慈愛の心 = (慈愛のコア*3)+25200
勇気の心 = (勇気のコア*3)+24600
決意の心 = (決意のコア*3)+ 24600
くじけぬ心= (ボディオブグレイス*2) + (防衛の壁*2) + 12000
不敗の意志 = 12000 +不滅の刻印 +剣闘士のブレスレット +聖徒の刻印 + ランブラーブーツ
永遠の支配 = 15000 +剣闘士のブレスレット +浄罪の香炉
神聖なる福音 = 15000 +真理の訓戒 + 浄罪の香炉+知恵のコア
慈愛の指輪 = 17400 + クイリンのリング +真理の訓戒 +ミスリルの聖杯 + ブリッツアーク

冷酷な大鎌 = 蒼穹のハンター + 並外れの闘士 + 諸王の冠 + 69600
悪意の刃 = 21600 + 蒼穹のハンター + 並外れの闘士 + 諸王の冠
主宰の籠手 = バジリカの聖炉 + 星の眷属 + 75000
無尽の征服 = 静寂のヴェール + 光の使徒 + 諸王の冠 + 100200
敏捷の星 = (敏捷の心 * 3) + 114000
先祖の遺産 = 黎明の歩み + 星の眷属 + 静寂のヴェール + 159000
勇気の星 = (勇気の心*3)+156000
決意の星 = (決意の心*3)+132000
知恵の星 = (知恵の心*3)+96000
慈愛の星 = (慈愛の心*3) + 132000
不屈の心 = 不敗の意志+永遠の支配+星の眷属+黎明の歩み+58200
聖堂の審判者 =防衛の壁 +くじけぬ心+(光の使徒*2)+50400
統率の角笛 = 永遠の支配+バジリカの聖炉+61200
英雄の誓い = (くじけぬ心*2)+(光の使徒*2)+48000
真意のトーチ = 諸王の冠+慈愛の指輪+並外れの闘士+ 5400
権威のスタッフ =神聖なる福音+(バジリカの聖炉*2)+36000
運命の砂時計 = 慈愛の指輪+神聖なる福音+クイリンのリング+蒼穹のハンター+ 51000
神々の聖杯 = 星の眷属+不敗の意志+黎明の歩み+9000

神々の聖杯component = {'星の眷属': 星の眷属, '不敗の意志': 不敗の意志, '黎明の歩み': 黎明の歩み}
my_relic = {'星の眷属': 1, '不屈の心': 1, '聖徒の刻印': 1, '不敗の意志': 1}

for name, cost in 神々の聖杯component.items():
    for key, value in my_relic.items():
        if key == name:
            print('素材:' + name)
            print(key, '所持数' + str(value))
            神々の聖杯 = 神々の聖杯 - (cost * value)
            break
    else:
        continue

print(神々の聖杯)


# for key, value in my_relic.items():
#     print(key, type(key))
#     print(value, type(value))
#     if key in 神々の聖杯材料.keys():
#         print(神々の聖杯 - int(str(神々の聖杯材料.values())))
